---
kind: method
id: M:Autodesk.Revit.DB.Electrical.Wire.GetMEPSystems
source: html/8c5df7ee-4ee6-50d5-ca5a-70dcd6f6961f.htm
---
# Autodesk.Revit.DB.Electrical.Wire.GetMEPSystems Method

Gets the systems to which the wire belongs.

## Syntax (C#)
```csharp
public IList<ElementId> GetMEPSystems()
```

## Returns
The systems to which the wire belongs.

## Remarks
One wire might belong to more than one circuit.